<template>
  <section class="districts farro-light">
    <div class="districts-head">
      <h2>Районы города</h2>

      <div class="districts-link">
        <h4 @click="showMap = false; getValue('list')" :class="{'active': !showMap}">Список</h4>
        <h4 @click="showMap = true; getValue('map')" :class="{'active': showMap}">Карта</h4>
      </div>
    </div>

    <div class="districts-body">

      <div class="map-districts"  data-aos="fade-up" v-if="showMap">
        <iframe src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d179689.8347701476!2d88.00200423789057!3d69.39934676823779!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x44ac5c403d18ab93%3A0x4024234d8fd6e107!2z0J3QvtGA0LjQu9GM0YHQuiwg0JrRgNCw0YHQvdC-0Y_RgNGB0LrQuNC5INC60YDQsNC5!5e0!3m2!1sru!2sru!4v1711356990557!5m2!1sru!2sru" width="600" height="450" style="border:0;" allowfullscreen="" loading="lazy" referrerpolicy="no-referrer-when-downgrade"></iframe>
      </div>
      
      <div class="list-districts" v-if="!showMap" >
        
        <div class="district" data-aos="fade-up">
          <h3>Талнах</h3>
          <div class="district-info">
            <p>
              Район Талнах является важной частью Норильска и его промышленной мощи. Талнах расположен в нескольких километрах к северо-востоку от Норильска и является ключевым районом в структуре города из-за своих обширных месторождений полезных ископаемых.
            </p>

            <p>
              Население района состоит в основном из работников промышленных предприятий и их семей. Для жителей создана развитая инфраструктура с жилыми комплексами, школами, медицинскими учреждениями и культурными центрами. Несмотря на промышленную направленность, Талнах обладает необходимыми удобствами для комфортного проживания.
            </p>

            <p>
              Жители Талнаха имеют возможность участвовать в культурных мероприятиях и праздниках, организуемых как в районе, так и в Норильске. Мероприятия часто направлены на сохранение истории и культурного наследия региона.
            </p>

            <p>Талнах — это не просто промышленная зона, но и место, где живут и трудятся люди, создавая уникальное сообщество в условиях Крайнего Севера.</p>
          </div>
        </div>

        <div class="district" data-aos="fade-up">  
          <h3>Кайеркан</h3>

          <div class="district-info">
            <p>
              Кайеркан – это один из районов города Норильск, расположенный примерно в 20 километрах к югу от центральной части города. Изначально развивавшийся как поселок рабочих, Кайеркан с течением времени превратился в полноценный жилой район с развитой инфраструктурой и своей уникальной атмосферой.
            </p>

            <p>
              Основание Кайеркана связано с развитием Норильского промышленного комплекса. Со временем поселок вырос в населенный пункт, где поселились работники промышленных предприятий и их семьи.
            </p>

            <p>
              Культурная жизнь Кайеркана богата и разнообразна. Регулярно проводятся культурные мероприятия, праздники и фестивали, которые способствуют укреплению общинного духа и сохранению традиций.
            </p>

            <p>
              Кайеркан окружен живописными северными ландшафтами, в том числе тундрой и тайгой. Это дает жителям возможность наслаждаться природой и заниматься различными видами отдыха, такими как пешие и лыжные прогулки, рыбалка и охота.
            </p>

            <p>Кайеркан – это не просто спальный район Норильска, но и место с сильным сообществом, где укоренены традиции и культура Севера, и которое продолжает развиваться, улучшая качество жизни своих жителей.</p>
          </div>
        </div>

        <div class="district" data-aos="fade-up">
          <h3>Оганер</h3>

          <div class="district-info">
            <p>
              Район Оганер является одним из жилых районов города Норильск, расположенный в его восточной части. Район был назван в честь реки Оганер, которая протекает в этом регионе. Оганер, как и многие другие районы Норильска, был спроектирован и построен в советскую эпоху, и его архитектура отражает характерные черты того времени.
            </p>

            <p>
               Район Оганер обладает развитой инфраструктурой, включающей в себя образовательные учреждения, медицинские центры, магазины, спортивные комплексы и парки. Это создает благоприятные условия для жизни семей и обеспечивает необходимые удобства для повседневной жизни.
            </p>

            <p>
              Несмотря на промышленный характер Норильска, район Оганер имеет доступ к живописным природным территориям, включая речные берега и обширные пространства тундры. Это позволяет жителям наслаждаться природой и заниматься активными видами отдыха.
            </p>

            <p>
              Оганер известен своим дружелюбным и тесно связанным сообществом. Жители района активно участвуют в социальной жизни, организуя различные мероприятия и праздники, которые способствуют укреплению соседских связей и культурного обмена.
            </p>

            <p>Район Оганер продолжает развиваться, сохраняя свою уникальную атмосферу и предоставляя жителям комфортные и функциональные условия для жизни на севере.</p>
          </div>
        </div>
      </div>
    </div>
  </section>
</template>

<style lang='less' scoped>
  .districts {
    padding: 100px 200px;
    
    @media (max-width: 800px) {
      padding: 100px 0px;
    }
    
    @media (max-width: 500px) {
      padding: 50px 10px;  
      
    }
    & .districts-head {
      padding: 10px 10px;
      display: flex;
      border-bottom: 1px solid #ffffffaf;

      & > h2 {
        margin-right: auto;
      }

      & .districts-link {
        display: flex;
        gap: 40px;

        & > h4 {
          padding: 0;
          cursor: pointer;
          transition: all 0.1s ease;
          border-bottom: 0px solid #00b3ff;

          &:hover {
            color: aquamarine;
            border-bottom: 3px solid aquamarine;

          }
        }
        & > h4.active {
          color: aquamarine;
          border-bottom: 3px solid aquamarine;
        }

      }
    }

    & .districts-body {
      
      & .map-districts {
        margin-top: 20px;
        width: 100%;
        
        & > iframe {
          width: 100%;
          height: 450px;
          border: none;
        }

      }

      & .list-districts {
        font-family: Arial, sans-serif;
        padding: 20px;

        & .district {
          margin-top: 50px;

          & > h3 {
            margin-bottom: 10px;
            font-size: 24px;
          }

          & .district-info {
            padding: 15px;
            border-radius: 5px;
            box-shadow: 0 2px 5px rgba(0, 0, 0, 0.427);

            & > p {
              margin-bottom: 10px;
              font-size: 16px;
              line-height: 1.6;
              text-align: justify;
            }
          }
        }
      }
    }
  }
</style>

<script setup>
  const showMap = ref(false);
  const currentValue = ref("list");

  function getValue(direction) {
    currentValue.value = direction;
  }
</script>